{
  "Home": "الرئيسية",
  "About": "من نحن",
  "Services": "الخدمات ",
  "Contact": "التواصل ",
  "Discover Our Services": "اكتشف خدماتنا",
  "View Solutions": "عرض الخدمات",
  "Let’s Talk Tech": "دعونا نتحدث عن التقنية",
  "What We OFFER": "ما نقدمه",
  "View All Services": "عرض جميع الخدمات",
  "Read More": "اقرأ المزيد",

  "Benefits With Our Service": "الفوائد مع خدمتنا",
  "Leading Digital Innovation for a Modern World": "قيادة الابتكار الرقمي لعالم حديث",
  "Transforming Ideas into Digital Solutions": "تحويل الأفكار إلى حلول رقمية فعّالة",
  "Drive business success with tailored digital strategies and technology-driven solutions.": "نساعدك في تحقيق النجاح من خلال استراتيجيات رقمية مبتكرة وحلول تقنية متقدمة.",
  "Empowering businesses to evolve and excel in a competitive landscape.": "تمكين الشركات من التطور والتفوق في سوق تنافسي.",
  "Connecting Technology & Business Needs": "جسر التواصل بين التكنولوجيا واحتياجات الأعمال",
  "Seamless Integration, Maximum Efficiency": "تكامل سلس، كفاءة قصوى",
  "Optimize your business operations with custom digital solutions that integrate effortlessly.": "حسّن عملياتك مع حلول رقمية مخصصة تندمج بسلاسة مع بيئة عملك.",
  "Our expertise helps you streamline processes and boost productivity.": "خبراتنا تساعدك على تبسيط العمليات وزيادة الإنتاجية.",
  "Shaping Tomorrow’s Technology Today": "نصنع اليوم تكنولوجيا الغد",
  "Prepare for the Future with Cutting-Edge Tech": "استعد للمستقبل بأحدث التقنيات المتطورة",
  "Stay ahead in a rapidly evolving digital landscape.": "ابقَ في الطليعة في عالم رقمي سريع التطور.",
  "We bring the latest innovations to empower your business.": "نقدم أحدث الابتكارات لتمكين أعمالك من النمو.",
  "Unlock new possibilities with advanced technologies.": "استكشف آفاقًا جديدة بفضل التقنيات المتقدمة.",
  "Stay ahead in a rapidly evolving digital landscape. We bring the latest innovations to empower your business.": "ابقَ دائمًا في المقدمة في عالم التكنولوجيا المتغير. نحن نضع بين يديك أحدث الابتكارات لدعم نجاحك.",

  "Excellent IT Services": "خدمات تكنولوجيا معلومات متميزة",

  "Digital Transformation": "التحول الرقمي",

  "Drive innovation and efficiency by transitioning to digital processes and solutions. We focus on optimizing workflows, reducing redundancies, and leveraging the latest technologies to enhance your organization's overall productivity and agility. Our tailored approach ensures a smooth and effective transformation aligned with your specific business goals and industry demands.": "نساعد الشركات على العمل بشكل أفضل وأسرع باستخدام الأدوات والتكنولوجيا الرقمية. وهذا يعني تغيير طريقة إنجاز الأمور لجعلها أسهل وأسرع. نتأكد من إنشاء خطة تتناسب مع احتياجات كل شركة حتى تتمكن من تحقيق أهدافها وتحقيق أداء جيد في صناعتها.",

  "Our team will guide you through each phase of digital transformation, from evaluating your current processes to implementing and optimizing new digital solutions. We help identify the best technologies, ensure staff training, and provide continuous support to ensure your organization achieves sustained benefits from its transformation journey.": "سيساعدك فريقنا خطوة بخطوة في رحلتك نحو استخدام المزيد من التكنولوجيا في عملك. سننظر في كيفية إنجاز الأمور الآن، ونختار أفضل الأدوات لاستخدامها، ونعلم الجميع كيفية استخدامها، ونكون متواجدين لمساعدتك طوال الطريق. هدفنا هو التأكد من حصول مؤسستك على نتائج جيدة تدوم طويلاً من استخدام هذه الأدوات الرقمية الجديدة.",

  "Digital Solutions": "الحلول رقمية",

  "Customized digital tools to streamline your business processes, improve productivity, and enhance operational efficiency. Our solutions are built to adapt to the specific requirements of your business, ensuring that they integrate seamlessly with your existing workflows and systems. By automating repetitive tasks and providing real-time data insights, we empower your team to focus on what matters most.": "أدوات رقمية مخصصة لتبسيط عمليات عملك، وزيادة الإنتاجية، وتعزيز الكفاءة التشغيلية. تم تصميم حلولنا لتلبية المتطلبات المحددة لعملك، مما يضمن تكاملاً سلسًا مع سير العمل والأنظمة الحالية. من خلال أتمتة المهام المتكررة وتوفير رؤى فورية للبيانات، نساعد فريقك على التركيز على الجوانب الأكثر أهمية.",

  "We’ll work with you to analyze your operational challenges and develop digital tools that address those needs. Whether it’s a custom software application, workflow automation, or a productivity suite, we provide hands-on support from concept to deployment, including training and ongoing maintenance.": "سنعمل معك لتحليل التحديات التشغيلية وتطوير الأدوات الرقمية التي تلبي تلك الاحتياجات. سواء كان الأمر يتعلق بتطبيق برمجي مخصص، أو أتمتة سير العمل، أو حزمة إنتاجية، فإننا نقدم الدعم الكامل من الفكرة حتى الإطلاق، مع توفير التدريب والصيانة المستمرة.",

  "Search Engine Optimization": "تحسين محركات البحث",

  "Boost your online presence and rank higher in search results to reach a larger audience and increase engagement. Our SEO strategies are data-driven and tailored to align with the latest search engine algorithms, ensuring sustained improvement in organic visibility. With a focus on both on-page and off-page SEO tactics, we help your brand gain prominence in the digital space.": "عزز وجودك الرقمي وارتفع في نتائج البحث للوصول إلى جمهور أوسع وزيادة التفاعل. تعتمد استراتيجياتنا في تحسين محركات البحث على البيانات وتتماشى مع أحدث خوارزميات البحث، مما يضمن تحسنًا مستدامًا في الظهور الطبيعي. مع التركيز على أساليب التحسين الداخلية والخارجية، نساعد علامتك التجارية على البروز في المجال الرقمي.",

  "Our SEO experts will perform a thorough analysis of your website and online presence, identifying areas for improvement and opportunities to enhance visibility. We will implement effective keyword strategies, optimize content, and build quality backlinks, all aimed at driving traffic and boosting your search engine rankings.": "سيقوم خبراؤنا في تحسين محركات البحث بإجراء تحليل شامل لموقعك وحضورك عبر الإنترنت، لتحديد مجالات التحسين وفرص تعزيز الظهور. سنقوم بتطبيق استراتيجيات فعالة للكلمات الرئيسية، وتحسين المحتوى، وبناء روابط خارجية ذات جودة، بهدف زيادة حركة المرور وتحسين تصنيف موقعك في محركات البحث.",

  "Digital Consultant": "استشاري رقمي",

  "Expert guidance to help navigate digital challenges and leverage technology for growth. Our consulting services are designed to help you make informed decisions and implement strategies that maximize your technology investments. From strategic planning to project management, we offer end-to-end support to empower your business with the right tools and insights.": "إرشاد متخصص لمساعدتك في مواجهة التحديات الرقمية والاستفادة من التكنولوجيا لتحقيق النمو. تم تصميم خدماتنا الاستشارية لمساعدتك على اتخاذ قرارات مدروسة وتنفيذ استراتيجيات تعظم من استثماراتك التكنولوجية. من التخطيط الاستراتيجي إلى إدارة المشاريع، نقدم دعماً كاملاً لتمكين عملك بالأدوات والرؤى المناسبة.",

  "We provide personalized consultation services to help your organization set clear digital goals and develop a roadmap for achieving them. Our team is committed to helping you stay ahead of technology trends, improve operational efficiency, and create a robust digital foundation for future growth.": "نقدم خدمات استشارية مخصصة لمساعدة مؤسستك في تحديد أهداف رقمية واضحة وتطوير خطة لتحقيقها. يلتزم فريقنا بمساعدتك على البقاء في مقدمة اتجاهات التكنولوجيا، وتحسين الكفاءة التشغيلية، وخلق أساس رقمي قوي لتحقيق نمو مستقبلي.",

  "Artificial Intelligence": "الذكاء الاصطناعي",

  "Innovative AI solutions designed to automate tasks, analyze data, and create smarter systems that improve your business outcomes. We provide comprehensive AI services, including machine learning, data analytics, and natural language processing, to unlock actionable insights and create efficiencies across various business processes.": "حلول ذكاء اصطناعي مبتكرة مصممة لأتمتة المهام، وتحليل البيانات، وإنشاء أنظمة ذكية تحسن نتائج عملك. نقدم خدمات شاملة في الذكاء الاصطناعي، بما في ذلك التعلم الآلي وتحليل البيانات ومعالجة اللغة الطبيعية، لتوفير رؤى قابلة للتنفيذ وخلق كفاءات في مختلف العمليات التجارية.",

  "We’ll guide you through the process of identifying where AI can have the greatest impact on your business, from enhancing customer experiences to optimizing back-office operations. Our team offers full-cycle AI development and integration, ensuring that you can leverage the power of AI to stay competitive and innovative.": "سنرشدك في عملية تحديد المجالات التي يمكن للذكاء الاصطناعي أن يحدث فيها أكبر تأثير على عملك، بدءًا من تحسين تجارب العملاء إلى تحسين عمليات المكتب الخلفي. يقدم فريقنا خدمات تطوير وتكامل شاملة للذكاء الاصطناعي، مما يضمن لك الاستفادة من قدرات الذكاء الاصطناعي للبقاء في المنافسة والابتكار.",

  "Management Consulting": "استشارات إدارية",

  "Strategic guidance focused on improving management practices, optimizing resource allocation, and achieving business objectives. Our management consulting services provide expert advice on operational efficiency, financial planning, and organizational alignment, all aimed at helping your business reach its full potential.": "إرشاد استراتيجي يركز على تحسين ممارسات الإدارة، وتخصيص الموارد بكفاءة، وتحقيق أهداف العمل. توفر خدماتنا الاستشارية نصائح خبراء حول الكفاءة التشغيلية، والتخطيط المالي، وتوافق التنظيم، لتمكين عملك من تحقيق كامل إمكاناته.",

  "Our consultants will conduct an in-depth assessment of your management and operational processes, identify areas for improvement, and provide actionable strategies for growth. We work closely with your leadership team to implement best practices that drive sustainable success and long-term profitability.": "سيقوم مستشارونا بإجراء تقييم شامل لعملياتك الإدارية والتشغيلية، وتحديد مجالات التحسين، وتقديم استراتيجيات قابلة للتنفيذ للنمو. نعمل عن قرب مع فريق القيادة لديك لتطبيق أفضل الممارسات التي تدعم النجاح المستدام والربحية على المدى الطويل.",

  "Developing Creative Ideas": "تطوير الأفكار الإبداعية",

  "We bring innovation and creativity to the forefront, transforming abstract ideas into tangible solutions. Our team collaborates closely with you to explore fresh perspectives, push boundaries, and unlock new opportunities that align with your business goals. By fostering a creative approach, we help you stay competitive and differentiate your brand in the market.": "نجلب الابتكار والإبداع إلى المقدمة، ونحوّل الأفكار المجردة إلى حلول ملموسة. يتعاون فريقنا معك لاستكشاف آفاق جديدة وتوسيع الحدود وفتح فرص تتماشى مع أهداف عملك. بفضل هذا النهج الإبداعي، نساعدك على تعزيز قدرتك التنافسية وتمييز علامتك التجارية في السوق.",

  "Our experts work alongside you to generate and refine creative concepts that align with your brand vision. We conduct market research, brainstorm innovative solutions, and develop prototypes, ensuring each idea has a clear path from concept to execution. Our goal is to empower you with creative solutions that make a lasting impact.": "يعمل خبراؤنا إلى جانبك لتطوير وصقل الأفكار الإبداعية المتوافقة مع رؤية علامتك التجارية. نقوم بإجراء أبحاث السوق، ونطرح حلولاً مبتكرة، ونطوّر نماذج أولية، لضمان أن لكل فكرة طريق واضح من المفهوم إلى التنفيذ. هدفنا هو تزويدك بحلول إبداعية تحدث تأثيراً دائماً.",

  "Emerging Technologies": "التقنيات الناشئة",

  "Stay ahead of the curve by adopting the latest technologies that drive business innovation. We help you navigate and implement emerging technologies like blockchain, IoT, augmented reality, and more, giving your business a competitive edge in an increasingly tech-driven world. Our solutions are tailored to provide strategic advantages and adapt to future advancements.": "ابقَ في الطليعة من خلال اعتماد أحدث التقنيات التي تدفع عجلة الابتكار. نساعدك على التنقل في عالم التقنيات الناشئة مثل البلوك تشين، إنترنت الأشياء، الواقع المعزز وغيرها، مما يمنح عملك ميزة تنافسية في عالم تتزايد فيه أهمية التكنولوجيا. حلولنا مصممة لتوفير مزايا استراتيجية تتكيف مع التطورات المستقبلية.",

  "We assess the potential of various emerging technologies to enhance your business operations and strategy. Our team provides guidance on integration, scalability, and long-term impact, ensuring that new technologies align with your goals and resources. By implementing the latest advancements, we help you position your business for sustained growth and innovation.": "نقيّم إمكانات التقنيات الناشئة لتعزيز عملياتك واستراتيجيتك. يقدم فريقنا إرشادات حول التكامل، وقابلية التوسع، والأثر الطويل الأمد، مما يضمن توافق التقنيات الجديدة مع أهدافك ومواردك. من خلال اعتماد أحدث التطورات، نساعدك على تمكين عملك للنمو المستدام والابتكار.",

  "Innovating Digital Solutions for Tomorrow's Success": "ابتكار حلول رقمية لنجاح الغد",

  "At Vision Dimensions, we dedicate ourselves to transforming businesses through innovative technology solutions. Our expert team crafts customized digital strategies that address the unique challenges of our clients, ensuring that every project empowers them for success in a rapidly evolving world.": "في أبعاد الرؤيا، نكرّس أنفسنا لتحويل الأعمال من خلال حلول تكنولوجية مبتكرة. يقوم فريقنا المتخصص بتصميم استراتيجيات رقمية مخصصة تلبي التحديات الفريدة لعملائنا، لضمان أن كل مشروع يمكّنهم من تحقيق النجاح في عالم سريع التطور.",

  "Comprehensive Solutions": "حلول شاملة",

  "Providing end-to-end services tailored to meet the goals of each client.": "تقديم خدمات شاملة ومخصصة لتحقيق أهداف كل عميل.",

  "Expert Support 24/7": "دعم الخبراء 24/7",

  "Dedicated around-the-clock support to ensure seamless operation and client satisfaction.": "دعم متواصل على مدار الساعة لضمان سير العمل بسلاسة ورضا العملاء.",

  "Learn More About Us": "تعرف علينا أكثر",

  "Satisfied Clients": "عملاء راضون",

  "Technical Projects": "مشاريع فنية",

  "Consultant Projects": "مشاريع استشارية",

  "Media Posts": "منشورات إعلامية",

  "Web App Development Solution": "حل تطوير تطبيقات الويب",

  "Technology": "تكنولوجيا",

  "Robert Fox": "روبرت فوكس",

  "Amman, Jordan": "عمان، الأردن",

  "A comprehensive web app development solution tailored to client’s requirements.": "حل شامل لتطوير تطبيق ويب يلبي متطلبات العميل بدقة.",

  "Detailed description of the solution provided, the technology stack, and methodologies used.": "وصف مفصل للحل المقدم، وتقنيات التكنولوجيا المستخدمة، والمنهجيات المعتمدة.",

  "Technology Consultancy": "استشارات تكنولوجية",

  "Maintenance and Support": "الصيانة والدعم",

  "Requirements Gathering": "جمع المتطلبات",

  "Best practices implementation": "تطبيق أفضل الممارسات",

  "Project overview with insights into the development process and technology highlights.": "نظرة عامة على المشروع مع تسليط الضوء على عملية التطوير والتقنيات المستخدمة.",

  "Web app integration with innovative technology and streamlined features for user experience.": "دمج تطبيق الويب مع التكنولوجيا المبتكرة وميزات مبسطة لتحسين تجربة المستخدم.",

  "Cloud Infrastructure Optimization": "تحسين البنية التحتية السحابية",

  "Consulting": "استشارات",

  "Green Energy Solutions": "حلول الطاقة الخضراء",

  "Consulting services for optimizing cloud infrastructure to improve performance and reduce costs.": "خدمات استشارية لتحسين البنية التحتية السحابية لزيادة الأداء وتقليل التكاليف.",

  "Optimization project for cloud infrastructure focusing on performance, security, and cost management.": "مشروع تحسين البنية التحتية السحابية يركز على الأداء والأمان وإدارة التكاليف.",

  "Cost Reduction": "تخفيض التكلفة",

  "Security Enhancements": "تعزيزات الأمان",

  "Performance Optimization": "تحسين الأداء",

  "Scalability Improvements": "تحسين قابلية التوسع",

  "Consulting services tailored to enhance cloud efficiency and support long-term scalability.": "خدمات استشارية مخصصة لتحسين كفاءة السحابة ودعم التوسع طويل الأمد.",

  "Cloud consulting services aimed at achieving efficient infrastructure and optimized performance.": "خدمات استشارية سحابية تهدف إلى تحقيق بنية تحتية فعالة وأداء مثالي.",

  "Data Analytics Solution for Retail": "حل تحليل البيانات للبيع بالتجزئة",

  "Retail Insights Ltd.": "شركة رؤى التجزئة المحدودة",

  "Consulting for implementing a data analytics solution to drive insights and improve decision-making.": "خدمات استشارية لتنفيذ حلول تحليل البيانات لدعم الرؤى وتحسين اتخاذ القرارات.",

  "Data analytics solution to provide actionable insights, enhancing retail operations and strategies.": "حل لتحليل البيانات يوفر رؤى قابلة للتنفيذ، مما يعزز عمليات واستراتيجيات البيع بالتجزئة.",

  "Data Collection": "جمع البيانات",

  "Insight Generation": "توليد الرؤى",

  "Integration with Existing Systems": "التكامل مع الأنظمة الحالية",

  "Training and Support": "التدريب والدعم",

  "Implementation of a data-driven solution to empower retail decisions and strategic planning.": "تنفيذ حلول قائمة على البيانات لتمكين قرارات البيع بالتجزئة والتخطيط الاستراتيجي.",

  "Data analytics consulting tailored for retail to enhance insights and operational efficiency.": "استشارات تحليل البيانات المصممة لتجارة التجزئة لتحسين الرؤى والكفاءة التشغيلية.",

  "Artificial Intelligence (AI)-Powered Customer Support": "دعم العملاء بالذكاء الاصطناعي (AI)",

  "AI": "الذكاء الاصطناعي",

  "Global Tech Solutions": "حلول التكنولوجيا العالمية",

  "A sophisticated AI-driven chatbot solution tailored for customer support automation and engagement enhancement.": "حل متقدم يعتمد على الذكاء الاصطناعي لدعم العملاء وزيادة التفاعل عبر الدردشة الآلية.",

  "Implemented an AI-powered chatbot to streamline customer interactions, improve response times, and enhance engagement with real-time, data-driven insights.": "تم تنفيذ روبوت محادثة مدعوم بالذكاء الاصطناعي لتبسيط تفاعلات العملاء، وتحسين أوقات الاستجابة، وتعزيز التفاعل عبر رؤى بيانات فورية.",

  "Natural language processing for diverse inquiries": "معالجة اللغة الطبيعية للاستفسارات المتنوعة",

  "Seamless integration with CRM systems": "تكامل سلس مع أنظمة إدارة علاقات العملاء (CRM)",

  "Ensuring data privacy and security": "ضمان خصوصية وأمان البيانات",

  "Providing scalability for peak traffic periods": "توفير قابلية التوسع خلال فترات الذروة",

  "This project transformed the client’s customer service experience through AI, reducing workload for human agents and enabling 24/7 support capabilities.": "حول هذا المشروع تجربة خدمة العملاء للعميل عبر الذكاء الاصطناعي، مما قلل من عبء العمل على الوكلاء البشريين وأتاح دعمًا على مدار الساعة.",

  "Automated customer support with AI, boosting engagement and response speed while enhancing customer satisfaction.": "دعم عملاء آلي بالذكاء الاصطناعي، يزيد التفاعل وسرعة الاستجابة مع تحسين رضا العملاء.",

  "FROM OUR CASE studies": "من دراسات الحالة لدينا",

  "We Delivered Best Solution": "قدمنا أفضل الحلول",

  "Our offering": "عروضنا",

  "Enhance and Pioneer Using": "التعزيز والريادة باستخدام",

  "Technology Trends": "اتجاهات التكنولوجيا",

  "Explore More": "استكشف المزيد",

  "Work Process": "عملية العمل",

  "Our Development Process": "عملية التطوير لدينا",

  "Define Requirements": "تحديد المتطلبات",

  "We start by understanding your specific needs, analyzing your goals, and defining the scope of the project. This stage ensures we align our solutions with your expectations.": "نبدأ بفهم احتياجاتك المحددة، وتحليل أهدافك، وتحديد نطاق المشروع. هذه المرحلة تضمن توافق حلولنا مع توقعاتك.",

  "Design & Prototyping": "التصميم والنماذج الأولية",

  "Our designers create wireframes and prototypes to visualize the end product. This stage involves user feedback to refine the design before development.": "يقوم مصممونا بإنشاء مخططات ونماذج أولية لتصور المنتج النهائي. تتضمن هذه المرحلة ملاحظات المستخدم لتحسين التصميم قبل التطوير.",

  "Development": "التطوير",

  "We begin coding and building the actual product based on the approved design. During this stage, our development team implements the core functionality of your website or app.": "نبدأ بكتابة الكود وبناء المنتج بناءً على التصميم المعتمد. خلال هذه المرحلة، ينفذ فريق التطوير الوظائف الأساسية لموقعك أو تطبيقك.",

  "Testing & QA": "الاختبار وضمان الجودة",

  "We perform thorough testing to ensure everything functions properly, is secure, and meets quality standards. This helps us catch any bugs or issues before deployment.": "نجري اختبارات شاملة لضمان عمل كل شيء بشكل صحيح وآمن ووفقًا لمعايير الجودة. يساعدنا ذلك في اكتشاف أي أخطاء أو مشكلات قبل النشر.",

  "Final Solution / Deployment": "الحل النهائي / النشر",

  "Once testing is complete, we deploy the product to its final environment, ensuring smooth performance for end users.": "بمجرد اكتمال الاختبارات، نقوم بنشر المنتج في بيئته النهائية، لضمان أداء سلس للمستخدمين النهائيين.",

  "Maintenance & Updates": "الصيانة والتحديثات",

  "After deployment, we provide ongoing support, updates, and maintenance to keep your solution running smoothly and securely.": "بعد النشر، نقدم الدعم المستمر والتحديثات والصيانة للحفاظ على الحل الخاص بك يعمل بسلاسة وأمان.",

  "Transforming your vision into reality with cutting-edge technology and strategic insights.": "تحويل رؤيتك إلى واقع من خلال التكنولوجيا المتقدمة والرؤية الاستراتيجية .",

  "IT Solution": "حل تكنولوجي",

  "Quick Link": "روابط سريعة",

  "About Vision Dimensions": "عن أبعاد الرؤيا",
  "ABOUT VISION DIMENSIONS": "عن أبعاد الرؤيا",

  "Our Services": "خدماتنا",

  "Our Projects": "مشاريعنا",

  "Our Team": "فريقنا",

  "Contact Us": "اتصل بنا",

  "© All Copyright 2024 by": "© جميع الحقوق محفوظة 2024 بواسطة",

  "Vision Dimensions": "أبعاد الرؤيا",

  "Terms & Condition": "الشروط والأحكام",

  "Privacy Policy": "سياسة الخصوصية",

  "And More": "والمزيد",

  "Case Study Details": "تفاصيل دراسة الحالة",

  "Completed Date:": "تاريخ الإنجاز:",

  "Category:": "الفئة:",

  "Client:": "العميل:",

  "Location:": "الموقع:",

  "Our Challenge": "تحدياتنا",

  "Project Overview": "نظرة عامة على المشروع",

  "view All Case": "عرض جميع الحالات",

  "Case Study": "دراسة حالة",

  "IT Service:": "خدمة تكنولوجيا المعلومات:",

  "Service Details": "تفاصيل الخدمة",

  "Vision Dimensions is a company specialized in providing consulting and technical solutions in the field of digital transformation. Since its establishment, the company has been committed to delivering innovative IT solutions through highly qualified professionals, adhering to global standards, and implementing best practices and the latest technologies. Vision Dimensions maintains strategic partnerships with local and international partners to provide added-value services, which has strengthened its position among leading global companies in this field. The company has achieved tangible success in executing diverse projects in information technology, cybersecurity, data, and enterprise resource planning, establishing itself as synonymous with excellence in its services.": "شركة أبعاد الرؤيا متخصصة في تقديم خدمات الاستشارات والحلول التقنية في مجال التحول الرقمي. منذ تأسيسها، تلتزم الشركة بتقديم حلول تقنية مبتكرة عبر كوادر بشرية مؤهلة وفق المعايير العالمية، وتطبيق أفضل الممارسات وأحدث التقنيات. ترتبط أبعاد الرؤيا بشراكات استراتيجية مع شركاء محليين ودوليين لتوفير خدمات ذات قيمة مضافة، مما عزز مكانتها بين الشركات العالمية الرائدة في هذا المجال. حققت الشركة نجاحات ملموسة في تنفيذ مشاريع متنوعة في تقنية المعلومات والأمن السيبراني والبيانات وتخطيط موارد المؤسسات، لتصبح مرادفاً للتميز في خدماتها.",
  "Vision Dimensions is a leading provider of consulting and technical solutions in digital transformation. We deliver innovative IT solutions with a focus on global standards and cutting-edge technologies. Our strong partnerships with local and international collaborators enable us to offer high-value services. With proven success in IT, cybersecurity, data, and ERP projects, we have established ourselves as a trusted name in the industry.": "تعد شركة ابعاد الرؤيا من الشركات الرائدة في تقديم الحلول الاستشارية والتقنية في مجال التحول الرقمي. نحن نقدم حلول تكنولوجيا المعلومات المبتكرة مع التركيز على المعايير العالمية والتقنيات المتطورة. بفضل شراكاتنا الاستراتيجية مع شركاء محليين ودوليين، نتمكن من تقديم خدمات ذات قيمة مضافة. من خلال النجاح المثبت في مشاريع تكنولوجيا المعلومات، والأمن السيبراني، والبيانات، وإدارة موارد المؤسسات، أصبحنا اسماً موثوقاً في الصناعة.",
  "Ensuring Your Success Through Reliable IT Solutions": "ضمان نجاحك من خلال حلول تكنولوجيا المعلومات الموثوقة",
  "WHO WE ARE": "من نحن",
  "Our Portfolio Highlights":"أخر مشاريعنا",
  "Portfolio Details":"تفاصيل المشاريع",
  "Portfolio":"مشاريعنا",
  "How We Can Help": "كيف يمكننا المساعدة",

  "Enhanced operational efficiency": "كفاءة تشغيلية محسّنة",
  "Improved customer experience": "تحسين تجربة العملاء",
  "Data-driven decision making": "اتخاذ القرارات استنادًا إلى البيانات",
  "Scalability and growth": "التوسع والنمو",
  "Tailored software solutions": "حلول برمجية مخصصة",
  "Process automation": "أتمتة العمليات",
  "Cost reduction": "خفض التكاليف",
  "Increased productivity": "زيادة الإنتاجية",
  "Increased website traffic": "زيادة حركة المرور على الموقع",
  "Better brand visibility": "تحسين رؤية العلامة التجارية",
  "Improved search engine ranking": "تحسين ترتيب محركات البحث",
  "Higher conversion rates": "زيادة معدلات التحويل",
  "Expert advice": "نصائح من الخبراء",
  "Strategic technology planning": "التخطيط الاستراتيجي للتكنولوجيا",
  "Optimized digital processes": "تحسين العمليات الرقمية",
  "Enhanced business agility": "زيادة مرونة الأعمال",
  "Automation of repetitive tasks": "أتمتة المهام المتكررة",
  "Data analysis and insights": "تحليل البيانات والرؤى",
  "Enhanced customer experience": "تحسين تجربة العملاء",
  "Predictive analytics": "تحليلات تنبؤية",
  "Enhanced leadership strategies": "استراتيجيات قيادة محسّنة",
  "Increased profitability": "زيادة الربحية",
  "Innovative problem-solving": "حل المشكلات بطرق مبتكرة",
  "Enhanced brand identity": "تعزيز هوية العلامة التجارية",
  "Market differentiation": "تمييز السوق",
  "Increased customer engagement": "زيادة تفاعل العملاء",
  "Future-proof technology solutions": "حلول تقنية تدعم المستقبل",
  "Enhanced operational capabilities": "تعزيز القدرات التشغيلية",
  "Improved customer experiences": "تحسين تجارب العملاء",
  "Strategic competitive advantage": "ميزة تنافسية استراتيجية",
  "Improved operational efficiency": "تحسين الكفاءة التشغيلية",
  "Our offerings" : "خدماتنا",
  "View All Portfolio" : "عرض جميع المشاريع",



  "Contact Information": "معلومات التواصل",
  "Discover efficient and personalized support tailored to your needs. Our team is here to help you make informed decisions and provide seamless assistance whenever you need it.": "اكتشف دعمًا فعالًا ومخصصًا يناسب احتياجاتك. فريقنا هنا لمساعدتك في اتخاذ قرارات مستنيرة وتقديم المساعدة متى احتجت إليها.",
  "Call Us 24/7": "اتصل بنا على مدار الساعة",
  "Location": "الموقع",
  "Amman, Jordan - Tabarbour – Tareq St, Islamic International Arab Bank Complex, Building No. 110, 4th Floor – Office 401": "عمان، الأردن - طبربور، شارع طارق، مجمع البنك العربي الإسلامي الدولي، المبنى رقم 110، الطابق الرابع – مكتب 401",
  "Amman, Jordan - Tabarbour – Tareq St,": "عمان، الأردن - طبربور، شارع طارق،",
  "Islamic International Arab Bank Complex,": "مجمع البنك العربي الإسلامي الدولي،",
  "Building No. 110, 4th Floor – Office 401": "مبنى رقم 110، الطابق الرابع – مكتب 401",
  "Follow Social:": "تابعنا على:",
  "Facebook": "فيسبوك",
  "Twitter": "تويتر",
  "LinkedIn": "لينكدإن",
  "GET IN TOUCH": "ابقَ على تواصل",
  "Ready to Get Started?": "جاهز للبدء؟",
  "Connect with us to explore how we can assist you. Whether it’s a question or a new project, we’re excited to hear from you.": "تواصل معنا لاستكشاف كيف يمكننا مساعدتك. سواء كان لديك استفسار أو مشروع جديد، نحن متحمسون لسماعك.",
  "Your Name*": "اسمك*",
  "Your Name": "اسمك",
  "Your Email*": "بريدك الإلكتروني*",
  "Your Email": "بريدك الإلكتروني",
  "Write Message*": "اكتب رسالة*",
  "Write Message": "اكتب رسالة",
  "Send Message": "إرسال الرسالة",

  "Opening Hours" : "ساعات العمل",
  "Sunday - Thursday: 9.00 AM - 5.00 PM": "الأحد - الأربعاء: 9.00 ص - 5.00 م",
  "Phone Call" : "اتصل بنا",
  "Email" : "البريد الإلكتروني",
  "All Services" : "جميع الخدمات",
  "About Us": "من نحن",
  "IT Service": "خدماتنا"




}
